ba-backend/app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
  def index
    # @airplane = Airplane.all
    render json: Airplane.all

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @airplane = Airplane.find params[:id]

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "airplanes" SET "name" = $1, "updated_at" = $2 WHERE "airplanes"."id" = $3  [["name", "747 John"], ["updated_at", "2018-10-31 00:43:01.349242"], ["id", 1]]
---
  def update
    @airplane = Airplane.find params[:id]
    @airplane.save

    if @airplane.update(airplane_params)

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @airplane = Airplane.find params[:id]

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "airplanes" WHERE "airplanes"."id" = $1  [["id", 2]]
---
  def destroy
    airplane = Airplane.find params[:id]
    airplane.destroy