ba-backend/app/controllers/flights_controller.rb

  def show
    @flight = Flight.find params[:id]
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    @flight = Flight.find params[:id]
    @flight.save
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "flights" SET "flight_no" = $1, "updated_at" = $2 WHERE "flights"."id" = $3  [["flight_no", "BA1 - John"], ["updated_at", "2018-10-31 03:48:44.560419"], ["id", 11]]

  def edit
    @flight = Flight.find params[:id]
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]