ba-backend/app/controllers/reservations_controller.rb

  def index
    render json: Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def update
    @reservation = Reservation.find params[:id]
    @reservation.flights.destroy_all
    @flights = Flight.all
---
SELECT "flights".* FROM "flights"