ba-backend/app/views/flights/_form.html.erb

    <%= f.label :airplane_id, 'Airplane' %>
    <%= f.collection_select :airplane_id, Airplane.all, :id, :name, prompt: 'Please choose an airplane:' %>
---
SELECT "airplanes".* FROM "airplanes"